# GetViewNavigationToolSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNavigationToolSettings..::..GetViewNavigationToolSettings Method
ViewNavigationToolSettings Class See Also
---
Gets the instance of the settings for the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static ViewNavigationToolSettings GetViewNavigationToolSettings(
	Document pADoc
)
```

Visual Basic
---
```text
Public Shared Function GetViewNavigationToolSettings ( _
	pADoc As Document _
) As ViewNavigationToolSettings
```

Visual C++
---
```text
public:
static ViewNavigationToolSettings^ GetViewNavigationToolSettings(
	Document^ pADoc
)
```

# ### Parameters
pADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The instance of the settings for the given document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace